[
  {
    "path": "posts/2024-06-18-a-bigger-boat-larger-stock-cultures/",
    "title": "A Bigger Boat",
    "description": "Increasing the volume of my stock cultures to accomidate higher replication and running experiments in parallel.",
    "author": [
      {
        "name": "Alex Mendelson",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2024-06-18",
    "categories": [
      "Project Updates"
    ],
    "contents": "\r\n\r\n\r\n\r\n\r\nLogistics is an essential part of experimental design, and as I work towards the main experiments that will test my hypotheses and address my aims, there are many details to work out. First up is a basic problem: I don’t have enough rotifers.\r\nThe design of the evolution experiments slated for later this summer calls for 40 experimental cultures per ‘stock’ culture. My current plans for experimental cultures call for a density of 5 rotifers per mL of culture volume. The total culture volume is planned to be 20 mL, meaning I’ll need approximately 100 rotifers per experimental culture, and therefore 4,000 total per ‘stock’ culture.\r\nThe very rough estimates of density I’ve done so far place the carrying capacity of my 20 mL stock cultures at a density of 113 rotifers per mL, which wouldn’t be enough for highly-replicated evolution experiments. I need at least double the culture volume, but to be safe, I’m increasing culture volume by 5 times to 100 mL.\r\nTo start these new, larger cultures, we first counted the various clonal cultures in storage. This included 16 dedicated stock cultures, and 8 finished experimental cultures from a previous population growth rate experiment. Since the cultures from both of these sources were clonal, I chose to use whichever source had the highest abundance for each clone. This maximized my new cultures’ starting density, which is limited by how much volume can be removed from the least-dense culture without using it all up.\r\nNew 100 mL stock cultures were seeded with a consistent density of each clone:\r\n\r\n\r\nlibrary(tidyverse)\r\nlibrary(car)\r\nlibrary(knitr)\r\n\r\nsourceCultures <- data.frame(\r\n  Source = c(\"Stock\", \"Stock\", \"Pop1\", \"Pop1\", \"Pop1\", \"Stock\", \"Pop1\", \"Pop1\", \"Pop1\", \"Pop1\", \"Stock\", \"Stock\"),\r\n  CloneID = c(\"1.1\", \"1.2\", \"1.5\", \"1.6\", \"1.7\", \"2.1\", \"2.2\", \"2.3\", \"2.4\", \"2.5\", \"2.7\", \"1.8\"),\r\n  Count = c(34, 59, 228, 35, 65, 97, 105, 175, 141, 145, 101, 31))\r\n\r\ncountVol = 0.3         # volume counted in plate\r\nfinalDensity = 10      # rotifers per mL\r\nfinalVolume = 100      # stock culture volume, mL\r\n\r\nVolumeFinal <- (finalDensity * finalVolume)/ (sourceCultures$Count / countVol)\r\nsourceCultures <- cbind(sourceCultures, VolumeFinal)\r\n\r\n# I couldn't find any 10 mL pipette tips, so I included this column to easily use the 5 mL pipette twice\r\nVolFinHalf <- sourceCultures$VolumeFinal / 2\r\nsourceCultures <- cbind(sourceCultures, VolFinHalf)\r\n\r\nkable(sourceCultures)\r\n\r\nSource\r\nCloneID\r\nCount\r\nVolumeFinal\r\nVolFinHalf\r\nStock\r\n1.1\r\n34\r\n8.823529\r\n4.4117647\r\nStock\r\n1.2\r\n59\r\n5.084746\r\n2.5423729\r\nPop1\r\n1.5\r\n228\r\n1.315789\r\n0.6578947\r\nPop1\r\n1.6\r\n35\r\n8.571429\r\n4.2857143\r\nPop1\r\n1.7\r\n65\r\n4.615385\r\n2.3076923\r\nStock\r\n2.1\r\n97\r\n3.092783\r\n1.5463918\r\nPop1\r\n2.2\r\n105\r\n2.857143\r\n1.4285714\r\nPop1\r\n2.3\r\n175\r\n1.714286\r\n0.8571429\r\nPop1\r\n2.4\r\n141\r\n2.127660\r\n1.0638298\r\nPop1\r\n2.5\r\n145\r\n2.068966\r\n1.0344828\r\nStock\r\n2.7\r\n101\r\n2.970297\r\n1.4851485\r\nStock\r\n1.8\r\n31\r\n9.677419\r\n4.8387097\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2024-06-20T09:32:44-07:00",
    "input_file": "a-bigger-boat-larger-stock-cultures.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Evolution-mediated",
    "description": "Welcome to Evolution-mediated, a project focused on investigating evolution-mediated indirect effects of climate change on ecology in diverse natural communities.",
    "author": [
      {
        "name": "Alex Mendelson",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2024-06-15",
    "categories": [],
    "contents": "\r\nIn this project, I aim to investigate evolution-mediated indirect effects of increased temperature stress on competitive effect and competitive response. To do so, I’ll expose genetically diverse populations of an aquatic invertebrate to stressful and ambient temperatures for many (~50) generations, establishing two different microevolutionary histories of temperature. By exposing subsequent evolved populations to a natural competitor, I hope to observe differences in competitive ability (both effect and response) as mediated by microevolutionary change in population trait frequencies as a response to increased temperature stress. This blog will document each step—the good and the bad—in reaching for this goal over the next year.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/welcome/../../images/indirectInt.png",
    "last_modified": "2024-06-18T10:22:52-07:00",
    "input_file": {}
  }
]
